'''
Провести дисперсионный анализ для определения того, есть ли различия среднего роста среди взрослых футболистов, хоккеистов и штангистов.
Даны значения роста в трех группах случайно выбранных спортсменов:
Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.
'''
import pandas as pd
from statsmodels.stats.multicomp import pairwise_tukeyhsd
from scipy import stats
import numpy as np

x1 = np.array([173, 175, 180, 178, 177, 185, 183, 182])
x2 = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180])
x3 = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170])

# проверка на нормальность

print(stats.shapiro(x1))
print(stats.shapiro(x2))
print(stats.shapiro(x3))

# (0.9775081276893616, 0.9495397210121155)
# (0.9579195976257324, 0.7763133645057678)
# (0.93868088722229, 0.5051169991493225)
# Все выборки имеют нормальное распределение

# тест на равернсво дисперсий
print(stats.bartlett(x1, x2, x3))
# BartlettResult(statistic=0.4640521043406442, pvalue=0.7929254656083131)
# H0 не отвергается, дисперсии трех групп равны -> проводим дисперсионный анализ

print(stats.f_oneway(x1, x2, x3))
# F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698694)
# H0 отвергается, есть различия среднего роста среди трех групп

# между какими группами есть различия
df = pd.DataFrame({"score": [173, 175, 180, 178, 177, 185, 183, 182, 177, 179, 180, 188, 177, 172, 171, 184, 180,
                  172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170], "group": np.repeat(["x1", "x2", "x3"], repeats= [8, 9, 11])})

# print(df)

tukey = pairwise_tukeyhsd(df["score"], df["group"], alpha = 0.05)
# print(tukey)

#  Multiple Comparison of Means - Tukey HSD, FWER=0.05 
# =====================================================
# group1 group2 meandiff p-adj   lower    upper  reject
# -----------------------------------------------------
#     x1     x2  -0.4583    0.9  -6.2722  5.3555  False
#     x1     x3  -6.3977 0.0218 -11.9573 -0.8382   True
#     x2     x3  -5.9394 0.0283 -11.3172 -0.5616   True
# -----------------------------------------------------

# H0 для x1 и x2 не отвергается, различий среднего роста между группами футбоистов и хоккеистов нет, между остальными сочетаниями групп статистически значимые различия имеются с alpha = 0.05. 