import numpy as np
x = np.array([167, 181, 174, 178, 175, 164, 182, 178, 193, 166, 154, 170, 177])

# Смещенные стандарное отклонение и дисперсия

# print(np.std(x)) # смещенное стандартное отклонение - standed diviation
# # 9.382092977531892

# print(np.var(x)) # смещенная дисперсия - variance
# # 88.02366863905326

# print(np.sqrt(np.var(x))) # квадратный корень от дисперсии - square root
# # 9.382092977531892


# # Несмещенные стандарное отклонение и дисперсия

# print(np.std(x, ddof=1)) # несмещенное стандартное отклонение - standed diviation
# # 9.765191977579056

# print(np.var(x, ddof=1)) # несмещенная дисперсия - variance
# # 5.35897435897436

# print(np.sqrt(np.var(x, ddof=1))) # квадратный корень от дисперсии - square root
# # 9.765191977579056


# Расчёт медианы

z = np.array([100,80,75,77,89,33,45,25,65,17,30,24,57,55,70,75,65,84,90,150])
print(z.shape)
# (20,)
z.sort()
print(z)
# [ 17  24  25  30  33  45  55  57  65  65  70  75  75  77  80  84  89  90
#  100 150]
print((z[9]+z[10])/2)
# 67.5
